tap "stve/formulae"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "heroku/brew"

# Unix
brew "git"
brew "openssl"
brew "the_silver_searcher"
brew "zsh"

# Utilities
brew "direnv"
brew "exiftool"
brew "ffmpeg"
brew "lame"
brew "terraform"
brew "youtube-dl"

# PGP
brew "gpg2"

# Heroku
brew "heroku/brew/heroku"

# GitHub
brew "gh"

# Image manipulation
brew "imagemagick"

# MacOS
brew "mas"

# Programming languages and package managers
brew 'asdf'
brew "go"
brew "libyaml" # should come after openssl
brew "yarn"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed
brew "memcached", restart_service: :changed

# Database Utilities
brew "libmemcached"

# Personal homebrew packages
brew "scar"

# Applications
cask "alfred"
cask "appcleaner"
cask "atom"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "hocus-focus"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "oversight"
cask "paw"
cask "quitter"
cask "skype"
cask "tableplus"
cask "visual-studio-code"

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
